uhnp/src/InformationRegisters/ПараметрыЛимитирования/ПараметрыЛимитирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитирования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПериодовЛимитирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРезервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьАналитикиСтатьиБюджетаПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаПоУмолчанию</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПланированиеЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезервированиеВПериодичностиПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПараметрыЛимитированияВалютыЦФО/ПараметрыЛимитированияВалютыЦФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитированияВалютыЦФО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВалютаЛимитирования</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/РежимыКонтроляДокументов/РежимыКонтроляДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыКонтроляДокументов</name>
  <enumValues>
    <name>Блокировать</name>
  </enumValues>
  <enumValues>
    <name>Информировать</name>
  </enumValues>
  <enumValues>
    <name>НеКонтролировать</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыОпределенияВалютыЛимитирования/СпособыОпределенияВалютыЛимитирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОпределенияВалютыЛимитирования</name>
  <enumValues>
    <name>ВалютаОперации</name>
  </enumValues>
  <enumValues>
    <name>ВалютаЛимитированияЦФО</name>
  </enumValues>
  <enumValues>
    <name>ВалютаУпрУчета</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/ПараметрыЛимитирования/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Период) Тогда 
		
		Если Параметры.Свойство("ЗначенияЗаполнения") И  Параметры.ЗначенияЗаполнения.Свойство("Период") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Период) Тогда	
			ПараметрыЗаписей = РегистрыСведений.ПараметрыЛимитирования.ПараметрыЛимитированияЗаПериодом(Запись.ВидБюджета, Параметры.ЗначенияЗаполнения.Период);
		Иначе
			ПараметрыЗаписей = РегистрыСведений.ПараметрыЛимитирования.ПараметрыЛимитированияЗаПериодом(Запись.ВидБюджета, Дата(3999, 12, 31));
		КонецЕсли;
		
		Если ПараметрыЗаписей.ПараметрыДоПериод = Неопределено Тогда
			
			Если Параметры.Свойство("Направление") И Параметры.Направление = -1 Тогда 
				Запись.Период = РегистрыСведений.ПараметрыЛимитирования.ОтнятьПериодОтДаты(Запись.Период, Запись.ПериодичностьЛимитирования);
			ИначеЕсли Параметры.Свойство("Направление") И Параметры.Направление = 1 Тогда
				Запись.Период = РегистрыСведений.ПараметрыЛимитирования.ДобавитьПериодКДате(Запись.Период, Запись.ПериодичностьЛимитирования);
			Иначе
				Запись.Период = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), 1));
			КонецЕсли;
			
		Иначе
			
			ПараметрыДоПериод = ПараметрыЗаписей.ПараметрыДоПериод;
			ДатаДвижений = ПараметрыЗаписей.ПериодДвижений;
			Если ДатаДвижений = Неопределено Тогда
				ДатаДвижений = Дата(1, 1, 1);
			КонецЕсли;
			
			Если ДатаДвижений < ПараметрыДоПериод Тогда
				НачальныйПериод = ПараметрыДоПериод;
			Иначе
				НачальныйПериод = ДатаДвижений;
			КонецЕсли;

			Если Параметры.Свойство("Направление") И Параметры.Направление = -1 Тогда
				Запись.Период = РегистрыСведений.ПараметрыЛимитирования.ОтнятьПериодОтДаты(НачальныйПериод, ПараметрыЗаписей.ПараметрыДоПериодичность);
			Иначе
				Запись.Период = РегистрыСведений.ПараметрыЛимитирования.ДобавитьПериодКДате(НачальныйПериод, ПараметрыЗаписей.ПараметрыДоПериодичность);
			КонецЕсли;
			
			Запись.ПланированиеЗакупок = ПараметрыЗаписей.ПланированиеЗакупок;
			
		КонецЕсли; 
		
	Иначе
		
		ПериодЗаписиБД = Запись.Период;  
		ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	УстановитьПодсказкиДляУчетаАналитик();     
	
	Если РегистрыСведений.ПараметрыЛимитирования.ЕстьДвиженияВПериоде(Запись.ВидБюджета, Запись.Период) Тогда
		Элементы.ПериодичностьЛимитированияБюджета.ТолькоПросмотр = Истина;
		Элементы.ПериодЛимитирования.ТолькоПросмотр = Истина;
		Элементы.ПериодЛимитирования.Подсказка = 
			Нстр("ru = 'Период регламентируемый записью содержит движения документов. Для изменения параметров лимитирования следует добавить новую запись с другим периодом '");
		Элементы.ПериодЛимитирования.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	КонецЕсли;    
	
	ПерезаполнитьДоступныеПериоды();
	
	ЗаполнитьСписокВыбораПериодичность();

	ПериодичностьРезервирования = ?(Запись.РезервированиеВПериодичностиПланирования, 1, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если ОшибкаПериода Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Элементы.Период.Подсказка;
		Сообщение.ПутьКДанным = "Запись.Период";
		Сообщение.Сообщить();
	КонецЕсли;     
	
	Запись.КонтрольРезервов = Запись.КонтрольЛимитов;         
	
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроверитьПравилаПериодичности(ТекущийОбъект, Отказ);

КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаписанПериод = Истина;

	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ВидБюджета", Запись.ВидБюджета);
	ПараметрыОповещения.Вставить("ПериодЛимитирования", Запись.Период);
	
	Оповестить("ИзмененыПараметрыЛимитированияБюджета", ПараметрыОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если Не Запись.ИспользоватьЛимитирование Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СпособОпределенияВалютыЛимитирования");
		МассивНепроверяемыхРеквизитов.Добавить("ПериодичностьЛимитирования");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗакрытиеФормы Тогда
		ЗакрытиеФормы = Истина;
		Отказ = Истина;
		
		Результат = Новый Структура;
		Результат.Вставить("ЗаписанПериод", ЗаписанПериод);
		Результат.Вставить("ВидБюджета", Запись.ВидБюджета);
		Результат.Вставить("Период", Запись.Период);
		
		Закрыть(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидБюджетаПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораПериодичность();

КонецПроцедуры  

&НаКлиенте
Процедура ПериодичностьЛимитированияПриИзменении(Элемент)
	
	ПериодичностьЛимитированияПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВалютаЛимитированияЦФОНажатие(Элемент)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Период", Запись.Период);
	Отбор.Вставить("ВидБюджета", Запись.ВидБюджета);

	ДопПараметры = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.ПараметрыЛимитированияВалютыЦФО.ФормаСписка", 
				 ДопПараметры, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЛимитированиеПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура РежимКонтроляЛимитовПриИзменении(Элемент)    

	Если Запись.КонтрольЛимитов = ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.Блокировать")
		Или Запись.КонтрольЛимитов = ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.Информировать") Тогда
		
		Запись.ИспользоватьЛимитирование = Истина;
		Если ЗначениеЗаполнено(РежимКонтроляРезервовСохраненный) Тогда
			Запись.КонтрольРезервов = РежимКонтроляРезервовСохраненный;
			РежимКонтроляРезервовСохраненный = ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.ПустаяСсылка");
			РежимКонтроляРезервовПриИзменении(Элемент);
		Иначе
			УправлениеФормой();
		КонецЕсли;  
		
	Иначе
		
		РежимКонтроляРезервовСохраненный = Запись.КонтрольРезервов;
		Запись.КонтрольРезервов = ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.НеКонтролировать");
		РежимКонтроляРезервовПриИзменении(Элемент);    
		
	КонецЕсли;      
	
	КонтрольУХКлиентСервер.ПриИзмененииКонтроляЛимитов(Запись["КонтрольЛимитов"], Запись["КонтрольРезервов"]);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимКонтроляРезервовПриИзменении(Элемент)
	
	Если Запись.КонтрольРезервов = ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.Блокировать") 
		Или Запись.КонтрольРезервов = ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.Информировать") Тогда
		Запись.ИспользоватьРезервирование = Истина;
	Иначе
		Запись.ИспользоватьРезервирование = Ложь;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособОпределенияВалютыЛимитированияПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура РежимКонтроляРезервовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ДанныеВыбора = Новый СписокЗначений;
	Если Запись.КонтрольЛимитов = ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.НеКонтролировать") Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.НеКонтролировать"));
	ИначеЕсли Запись.КонтрольЛимитов = ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.Информировать") Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.НеКонтролировать"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.Информировать"));
	ИначеЕсли Запись.КонтрольЛимитов = ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.Блокировать") Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.НеКонтролировать"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.Информировать"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.Блокировать"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьРезервированияПриИзменении(Элемент)
	
	Если ПериодичностьРезервирования = 1 Тогда
		Запись.РезервированиеВПериодичностиПланирования = Истина;
	Иначе
		Запись.РезервированиеВПериодичностиПланирования = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.ИспользоватьРезервирование.ТолькоПросмотр = Не Запись.ИспользоватьЛимитирование;
	Элементы.СпособОпределенияВалютыЛимитирования.АвтоОтметкаНезаполненного = Не Запись.ИспользоватьЛимитирование;
	Элементы.СпособОпределенияВалютыЛимитирования.АвтоВыборНезаполненного = Не Запись.ИспользоватьЛимитирование;
	
	ДоступностьРезервирования = ЗначениеЗаполнено(Запись.КонтрольЛимитов) И 
		Запись.КонтрольЛимитов <> ПредопределенноеЗначение("Перечисление.РежимыКонтроляДокументов.НеКонтролировать");
	Элементы.РежимКонтроляРезервов.ТолькоПросмотр = Не ДоступностьРезервирования;
	
	ВидимостьВалютЦФО = (Запись.СпособОпределенияВалютыЛимитирования 
		= ПредопределенноеЗначение("Перечисление.СпособыОпределенияВалютыЛимитирования.ВалютаЛимитированияЦФО"));
	
	Элементы.ГруппаВВалютеЛимитированияЦФО.Видимость = ВидимостьВалютЦФО;
	Элементы.ПериодичностьРезервирования.Доступность =  НЕ ТолькоПросмотр;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкиДляУчетаАналитик()
	
	Подсказки = Новый Соответствие;
	Подсказки.Вставить(Истина, НСтр("ru = 'При контроле лимитов по статье бюджета будут использованы все ее аналитики.'"));
	Подсказки.Вставить(Ложь, НСтр("ru = 'При контроле лимитов по статье бюджета аналитики статьи бюджета не будут использованы.'"));
	
	ПодсказкиУчетАналитик = Новый ФиксированноеСоответствие(Подсказки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Запись.Период = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПериодичностьЛимитированияПриИзмененииНаСервере()

	ПерезаполнитьДоступныеПериоды();
	
КонецПроцедуры  

&НаСервере
Процедура ПерезаполнитьДоступныеПериоды()
	
	ЭтоСозданиеПредыдущегоПериода = Параметры.Свойство("Направление") И Параметры.Направление = -1;

	Если ЭтоСозданиеПредыдущегоПериода Тогда
		ПоследняяЗапись = РегистрыСведений.ПараметрыЛимитирования.СрезПервых(, Новый Структура("ВидБюджета", Запись.ВидБюджета));
	Иначе
		ПоследняяЗапись = РегистрыСведений.ПараметрыЛимитирования.СрезПоследних(, Новый Структура("ВидБюджета", Запись.ВидБюджета));
	КонецЕсли; 
	
	Если ПоследняяЗапись.Количество() Тогда
		ПоследнийПериод = ПоследняяЗапись[0].Период; 
		ПоследняяПериодичность = ПоследняяЗапись[0].ПериодичностьЛимитирования;
	Иначе
		ПоследнийПериод = НачалоГода(ТекущаяДатаСеанса()); 
		ПоследняяПериодичность = Перечисления.Периодичность.Год;
	КонецЕсли;

	ДоступныеПериоды = Элементы.ПериодЛимитирования.СписокВыбора;
	ДоступныеПериоды.Очистить();   
	
	Если ЗначениеЗаполнено(ПериодЗаписиБД) Тогда
		ДоступныеПериоды.Добавить(ПериодЗаписиБД, Формат(ПериодЗаписиБД, "ДЛФ=DD"));
	КонецЕсли;
	
	НоваяДата = ОбщегоНазначенияОПККлиентСервер.НачалоПериодаПоПериодичности(ПоследнийПериод, ПоследняяПериодичность); 
	Если ЭтоСозданиеПредыдущегоПериода Тогда
		ОкончаниеСтарогоПериода = РегистрыСведений.ПараметрыЛимитирования.ОтнятьПериодОтДаты(НоваяДата, ПоследняяПериодичность);
	Иначе
		ОкончаниеСтарогоПериода = РегистрыСведений.ПараметрыЛимитирования.ДобавитьПериодКДате(НоваяДата, ПоследняяПериодичность);
	КонецЕсли;
	
	НоваяДатаОкончания = ОбщегоНазначенияОПККлиентСервер.НачалоПериодаПоПериодичности(НоваяДата, Запись.ПериодичностьЛимитирования);
	Если ЭтоСозданиеПредыдущегоПериода Тогда
		ОкончаниеНовогоПериода = РегистрыСведений.ПараметрыЛимитирования.ОтнятьПериодОтДаты(НоваяДатаОкончания, Запись.ПериодичностьЛимитирования);
	Иначе 
		ОкончаниеНовогоПериода = РегистрыСведений.ПараметрыЛимитирования.ДобавитьПериодКДате(НоваяДатаОкончания, Запись.ПериодичностьЛимитирования);
	КонецЕсли;
	
	Если ОкончаниеНовогоПериода > ОкончаниеСтарогоПериода Тогда
		НоваяДата = ОкончаниеНовогоПериода;
	Иначе
		НоваяДата = ОкончаниеСтарогоПериода;
	КонецЕсли;
	
	Если ЭтоСозданиеПредыдущегоПериода Тогда
		
		НовыйПериод = ДоступныеПериоды.Добавить(НоваяДата, Формат(НоваяДата, "ДЛФ=DD"));
		НоваяДата = РегистрыСведений.ПараметрыЛимитирования.ДобавитьПериодКДате(НоваяДата, Запись.ПериодичностьЛимитирования);
		
	Иначе
		
		Пока НоваяДата < КонецГода(ДобавитьМесяц(ОкончаниеСтарогоПериода, 36)) Цикл
		
			НовыйПериод = ДоступныеПериоды.Добавить(НоваяДата, Формат(НоваяДата, "ДЛФ=DD"));
			НоваяДата = РегистрыСведений.ПараметрыЛимитирования.ДобавитьПериодКДате(НоваяДата, Запись.ПериодичностьЛимитирования);
		
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ПоследняяЗапись.Количество() = 0 Тогда   
		НоваяДата = ОбщегоНазначенияОПККлиентСервер.НачалоПериодаПоПериодичности(ПоследнийПериод, ПоследняяПериодичность);
		
		Если ДоступныеПериоды.НайтиПоЗначению(НоваяДата) = Неопределено Тогда
			ДоступныеПериоды.Вставить(0, НоваяДата, Формат(НоваяДата, "ДЛФ=DD"));	
		КонецЕсли;   
		
	КонецЕсли;
	
КонецПроцедуры // ПерезаполнитьДоступныеПериоды()    

&НаСервере
Процедура ЗаполнитьСписокВыбораПериодичность()

	СписокПериодичностиПланирования = ОперативноеПланированиеПовтИспУХ.ДоступныеПериодичностиПланирования();
	Элементы.ПериодичностьПланирования.СписокВыбора.ЗагрузитьЗначения(СписокПериодичностиПланирования);

	СписокПериодичностиЛимитирования = КонтрольЛимитовУХ.ДоступныеПериодичностиЛимитирования(Запись.ВидБюджета, Запись.Период);
	Элементы.ПериодичностьЛимитированияБюджета.СписокВыбора.ЗагрузитьЗначения(СписокПериодичностиЛимитирования);  

КонецПроцедуры 

&НаСервере
Процедура ПроверитьПравилаПериодичности(ТекущийОбъект, Отказ)
	
	ПериодичностьОП = ТекущийОбъект.ПериодичностьПланирования; 	
	ПериодичностьЛимитирования = ТекущийОбъект.ПериодичностьЛимитирования; 
	
	Если Не ЗначениеЗаполнено(ПериодичностьОП) 
		ИЛИ Не ЗначениеЗаполнено(ПериодичностьЛимитирования) Тогда
		Возврат;
	КонецЕсли;  
			
	ИндексПериодичностьОП = Перечисления.Периодичность.Индекс(ПериодичностьОП);   
	ИндексПериодичностьЛимитирования = Перечисления.Периодичность.Индекс(ПериодичностьЛимитирования);

	Если ИндексПериодичностьОП > ИндексПериодичностьЛимитирования Тогда   				
		
		ШаблонСообщения = НСтр("ru = 'Периодичность планирования ""%1"" не может быть больше периодичности лимитирования ""%2""'"); 
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПериодичностьОП, ПериодичностьЛимитирования); 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;   
	
КонецПроцедуры  

&НаКлиенте
Процедура ПериодичностьПланированияПриИзменении(Элемент)
	
	ПериодичностьПланированияПриИзмененииНаСервере();
	
КонецПроцедуры   

&НаСервере
Процедура ПериодичностьПланированияПриИзмененииНаСервере()
	
	Перем ОшибкаСравнения;       
	
	ПериодичностьЛимитирования = Запись.ПериодичностьЛимитирования; 
	КонтрольЛимитовУХ.СравнитьПериодичностьПланированияЛимитирования(
					Запись.ПериодичностьПланирования, ПериодичностьЛимитирования, ОшибкаСравнения); 
	                                                   
	Если ОшибкаСравнения = Истина Тогда 
		Запись.ПериодичностьПланирования = Неопределено;   
	Иначе    	
		СписокПериодичностиЛимитирования = КонтрольЛимитовУХ.ДоступныеПериодичностиЛимитирования(
									Запись.ВидБюджета, Запись.Период, Запись.ПериодичностьПланирования);
		Элементы.ПериодичностьЛимитированияБюджета.СписокВыбора.ЗагрузитьЗначения(СписокПериодичностиЛимитирования); 		
	КонецЕсли;  		
	
КонецПроцедуры   

#КонецОбласти
